back/app/Controllers/ApiController.php

                'pagination' => [
                    'current_page' => $page,
                    'per_page' => $perPage,
                    'total' => $ecoleModel->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `ECOLE`

                'success' => true,
                'columns' => ['numEleve', 'nom', 'prenom', 'numEcole'],
                'data' => $eleves,
                'pagination' => ['current_page' => $page, 'per_page' => $perPage, 'total' => $eleveModel->countAllResults(), 'last_page' => $eleveModel->pager->getPageCount(),]
---
SELECT COUNT(*) AS `numrows`
FROM `ELEVE`

    public function getMatieres()
    {
        $json = $this->request->getJSON();

        $matiereModel = new MatiereModel();

        $page = $json->page ?? 1;
        $perPage = $json->per_page ?? 10;
        $search = $json->search ?? '';

        try {
            // Appliquer le filtre de recherche si nécessaire
            if (!empty($search)) {
                $matiereModel->groupStart()
                    ->like('numMat', $search)
                    ->orLike('designMat', $search)
                    ->orLike('coef', $search)
                    ->groupEnd();
            }

            $matieres = $matiereModel->getMatierePaginated($perPage, $page);

            foreach ($matieres as $key => $matiere) {
                $matieres[$key]['nbrNote'] = $matiereModel->countNotes($matiere['numMat']);
            }

            return $this->respond([
                'success' => true,
                'columns' => ['numMat', 'designMat', 'coef'],
                'data' => $matieres,
                'pagination' => ['current_page' => $page, 'per_page' => $perPage, 'total' => $matiereModel->countAllResults(), 'last_page' => $matiereModel->pager->getPageCount(),]
---
SELECT COUNT(*) AS `numrows`
FROM `MATIERE`

    public function getNotes()
    {
        $json = $this->request->getJSON();

        $noteModel = new NoteModel();

        $page = $json->page ?? 1;
        $perPage = $json->per_page ?? 10;
        $search = $json->search ?? '';

        try {
            // Appliquer le filtre de recherche si nécessaire
            if (!empty($search)) {
                $noteModel->groupStart()
                    ->Like('numEleve', $search)
                    ->orLike('numMat', $search)
                    ->orLike('note', $search)
                    ->groupEnd();
            }

            $notes = $noteModel->getNotePaginated($perPage, $page);

            foreach ($notes as $key => $note) {
                $notes[$key]['nbrNote'] = $noteModel->countNotes($note['numEleve']);
            }

            return $this->respond([
                'success' => true,
                'columns' => ['anneeScolaire', 'numEleve', 'numMat', 'note'],
                'data' => $notes,
                'pagination' => ['current_page' => $page, 'per_page' => $perPage, 'total' => $noteModel->countAllResults(), 'last_page' => $noteModel->pager->getPageCount(),]
---
SELECT COUNT(*) AS `numrows`
FROM `NOTE`