back/app/Models/EcoleModel.php

SELECT *
FROM `ECOLE`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `ECOLE`
---
        public function getEcolePaginated($perPage, $currentPage) {
            return $this->paginate($perPage, 'ecoles', $currentPage);

SELECT COUNT(*) AS `numrows`
FROM `ELEVE`
WHERE `numEcole` = '001'
---
        public function countElevesInscrits($numEcole)
        {
            // Utilisation du Query Builder pour compter les élèves
            return $this->db->table('ELEVE')
                            ->where('numEcole', $numEcole)
                            ->countAllResults();