back/app/Models/EleveModel.php

SELECT `ELEVE`.*, `ECOLE`.`Design`
FROM `ELEVE`
JOIN `ECOLE` ON `ELEVE`.`numEcole` = `ECOLE`.`numEcole`
WHERE `ELEVE`.`numEleve` = '001'
---
    public function get_eleve_with_ecole($numEleve) {
        $builder = $this->db->table('ELEVE'); // Commencez avec la table ELEVE
        $builder->select('ELEVE.*, ECOLE.Design');
        $builder->join('ECOLE', 'ELEVE.numEcole = ECOLE.numEcole');
        $builder->where('ELEVE.numEleve', $numEleve);
        return $builder->get()->getRowArray(); // Utilisez getRowArray() pour un seul résultat

SELECT `n`.*, `m`.`designMat`, `m`.`coef`
FROM `NOTE` `n`
LEFT JOIN `MATIERE` `m` ON `n`.`numMat` = `m`.`numMat`
WHERE `n`.`numEleve` = '001'
AND `n`.`anneeScolaire` = '2022-2023'
---
    public function get_notes_by_eleve($numEleve, $anneeScolaire) {
        $builder = $this->db->table('NOTE n');
        $builder->select('n.*, m.designMat, m.coef');
        $builder->join('MATIERE m', 'n.numMat = m.numMat', 'left'); // 'left' join pour garder les notes même si matière supprimée
        $builder->where('n.numEleve', $numEleve);
        $builder->where('n.anneeScolaire', $anneeScolaire);

        $query = $builder->get();

SELECT *
FROM `ELEVE`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `ELEVE`
---
    public function getElevesPaginated($perPage, $currentPage)
    {
        return $this->paginate($perPage, 'eleves', $currentPage);

SELECT `NOTE`.`note`, `MATIERE`.`coef`
FROM `NOTE`
JOIN `MATIERE` ON `NOTE`.`numMat` = `MATIERE`.`numMat`
WHERE `NOTE`.`numEleve` = '001'
AND `NOTE`.`anneeScolaire` = '2022-2023'
---
    public function calculerMoyenne(string $numEleve, string $anneeScolaire): ?float
    {
        // Requête pour récupérer notes + coefficients
        $builder = $this->db->table('NOTE');
        $builder->select('NOTE.note, MATIERE.coef');
        $builder->join('MATIERE', 'NOTE.numMat = MATIERE.numMat');
        $builder->where('NOTE.numEleve', $numEleve);
        $builder->where('NOTE.anneeScolaire', $anneeScolaire);
        $notes = $builder->get()->getResult();

SELECT `ELEVE`.`numEleve` AS `numero`, `ELEVE`.`nom`, `ELEVE`.`prenom`, `ECOLE`.`design` AS `ecole`, `NOTE`.`anneeScolaire`, SUM(NOTE.note * MATIERE.coef)/SUM(MATIERE.coef) AS moyenne
FROM `ECOLE`
JOIN `ELEVE` ON `ELEVE`.`numEcole` = `ECOLE`.`numEcole`
JOIN `NOTE` ON `NOTE`.`numEleve` = `ELEVE`.`numEleve`
JOIN `MATIERE` ON `MATIERE`.`numMat` = `NOTE`.`numMat`
GROUP BY `numero`, `ELEVE`.`nom`, `ELEVE`.`prenom`, `ecole`, `NOTE`.`anneeScolaire`
ORDER BY `moyenne` DESC
 LIMIT 10
---
    public function getResults($perPage = null, $offset = null)
    {
        $builder = $this->db->table('ECOLE');
        $builder->select('ELEVE.numEleve AS numero, ELEVE.nom, ELEVE.prenom, ECOLE.design AS ecole, NOTE.anneeScolaire, SUM(NOTE.note * MATIERE.coef)/SUM(MATIERE.coef) AS moyenne');
        $builder->join('ELEVE', 'ELEVE.numEcole = ECOLE.numEcole');
        $builder->join('NOTE', 'NOTE.numEleve = ELEVE.numEleve');
        $builder->join('MATIERE', 'MATIERE.numMat = NOTE.numMat');
        $builder->groupBy('numero, ELEVE.nom, ELEVE.prenom, ecole, NOTE.anneeScolaire');
        $builder->orderBy('moyenne', 'DESC');

        // Ajout de la pagination si les paramètres sont fournis
        if ($perPage !== null && $offset !== null) {
            $builder->limit($perPage, $offset);
        }

        return $builder->get();