back/app/Models/MatiereModel.php

SELECT *
FROM `MATIERE`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `MATIERE`
---
    public function getMatierePaginated($perPage, $currentPage) {
        return $this->paginate($perPage, 'matieres', $currentPage);

SELECT COUNT(*) AS `numrows`
FROM `NOTE`
WHERE `numMat` = '001'
---
    public function countNotes($numMat)
    {
        return $this->db->table('NOTE')
                        ->where('numMat', $numMat)
                        ->countAllResults();