back/app/Models/NoteModel.php

    public function paire_exist($numEleve, $numMat) {
        return $this->where('numEleve', $numEleve)->where('numMat', $numMat)->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `NOTE`
WHERE `numEleve` = '006'
AND `numMat` = '005'

    public function getNotePaginated($perPage, $currentPage) {
        return $this->paginate($perPage, 'notes', $currentPage);
---
SELECT *
FROM `NOTE`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `NOTE`

    public function countNotes($numEleve)
    {
        return $this->db->table('NOTE')
                        ->where('numEleve', $numEleve)
                        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `NOTE`
WHERE `numEleve` = '001'